common/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`auth_key`='2bSREf-bn1T0EhYXRBZ2oTO5qT7IbgVG') AND (`status`=10)