api/modules/v1/controllers/ReservationController.php

SELECT * FROM `klinik` WHERE `id`='1'
INSERT INTO `klinik_map` (`id_klinik`, `tanggal`, `no_antrian`, `id_pasien`, `time_exam`) VALUES (1, '2017-09-03', 'A25', 3, '12.00 - 14.00')
---
    public function actionCreate()
    {
        $id_user = Yii::$app->user->identity->id;
        $id_klinik = Yii::$app->request->post('id_klinik');
        $data_klinik = Klinik::findOne($id_klinik);
        $queryCount = "SELECT count(*) FROM `klinik_map` WHERE id_klinik=:id_klinik and tanggal=:date";
        $count = Yii::$app->db->createCommand($queryCount, [
                    ':id_klinik' => $id_klinik,
                    ':date' => date('Y-m-d')
                ])
                ->queryScalar();
        $next_queue = $count + 1;

        Yii::$app->db->createCommand()
                ->insert('klinik_map', [
                    'id_klinik' => $id_klinik,
                    'tanggal' => date('Y-m-d'),
                    'no_antrian' => $data_klinik->kode_klinik.''.$next_queue,
                    'id_pasien' => $id_user,
                    'time_exam' => $this->showTimeExamination($next_queue),
                ])->execute();